TechDoc.org
* Architecture
The game is written mainly in elm, with the aid of css for styling and js for handling sound effects.
=Browser.document= is used for the overall architecture ( see [[https://package.elm-lang.org/packages/elm/browser/latest/Browser#document][package Browser]] for more details).

* elm files 
| file name                                                                                                                                                         | functionality                        |
| --                                                                                                                                                                | ----                                 |
| Action.elm, InitLevel.elm, NextRound.elm, RegionFill.elm, Todo.elm, Update.elm                                                                                    | funtions for update                  |
| Card.elm                                                                                                                                                          | definition of card                   |
| ColorScheme.elm, GameViewBasic.elm, GameViewButtons, GameViewCards, GameView.elm, GameViewTiles.elm, SvgDefs.elm, SvgSrc.elm, ViewCards.elm, View.elm, ViewMP.elm | view                                 |
| Geometry.elm, Parameters                                                                                                                                          | geometric definitions and parameters |
| Main.elm                                                                                                                                                          | declaration of architecture          |
| Message.elm                                                                                                                                                       | messages                             |
| Model.elm                                                                                                                                                         | model                                |
| Population.elm, Tile.elm, Map.elm                                                                                                                                 | types and functions for city         |
| Ports.elm                                                                                                                                                         | Interaction with js                  |
| Virus.elm                                                                                                                                                         | types and functions for virus        |




